zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K344_K324_K314_257BGA-pinctrl.h
/* LPSPI0 */
#define PTA0_LPSPI0_PCS7_O              NXP_SIUL2_PINMUX(0, 0, 0, 6, 0, 0)
#define PTA0_LPSPI0_PCS7_I              NXP_SIUL2_PINMUX(0, 0, 0, 0, 228, 1)
#define PTA1_LPSPI0_PCS6_O              NXP_SIUL2_PINMUX(0, 0, 1, 6, 0, 0)
#define PTA1_LPSPI0_PCS6_I              NXP_SIUL2_PINMUX(0, 0, 1, 0, 227, 1)
#define PTA7_LPSPI0_PCS1_O              NXP_SIUL2_PINMUX(0, 0, 7, 2, 0, 0)
#define PTA7_LPSPI0_PCS1_I              NXP_SIUL2_PINMUX(0, 0, 7, 0, 222, 3)
#define PTA15_LPSPI0_PCS3_O             NXP_SIUL2_PINMUX(0, 0, 15, 3, 0, 0)
#define PTA15_LPSPI0_PCS3_I             NXP_SIUL2_PINMUX(0, 0, 15, 0, 224, 1)
#define PTA16_LPSPI0_PCS4_O             NXP_SIUL2_PINMUX(0, 0, 16, 4, 0, 0)
#define PTA16_LPSPI0_PCS4_I             NXP_SIUL2_PINMUX(0, 0, 16, 0, 225, 1)
#define PTA26_LPSPI0_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 26, 4, 0, 0)
#define PTA26_LPSPI0_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 26, 0, 221, 3)
#define PTA30_LPSPI0_SOUT_O             NXP_SIUL2_PINMUX(0, 0, 30, 4, 0, 0)
#define PTA30_LPSPI0_SOUT_I             NXP_SIUL2_PINMUX(0, 0, 30, 0, 231, 4)
#define PTA31_LPSPI0_PCS1_O             NXP_SIUL2_PINMUX(0, 0, 31, 4, 0, 0)
#define PTA31_LPSPI0_PCS1_I             NXP_SIUL2_PINMUX(0, 0, 31, 0, 222, 2)
#define PTB0_LPSPI0_PCS0_O              NXP_SIUL2_PINMUX(0, 0, 32, 3, 0, 0)
#define PTB0_LPSPI0_PCS0_I              NXP_SIUL2_PINMUX(0, 0, 32, 0, 221, 1)
#define PTB1_LPSPI0_SOUT_O              NXP_SIUL2_PINMUX(0, 0, 33, 3, 0, 0)
#define PTB1_LPSPI0_SOUT_I              NXP_SIUL2_PINMUX(0, 0, 33, 0, 231, 3)
#define PTB4_LPSPI0_SOUT_O              NXP_SIUL2_PINMUX(0, 0, 36, 3, 0, 0)
#define PTB4_LPSPI0_SOUT_I              NXP_SIUL2_PINMUX(0, 0, 36, 0, 231, 2)
#define PTB5_LPSPI0_PCS1_O              NXP_SIUL2_PINMUX(0, 0, 37, 3, 0, 0)
#define PTB5_LPSPI0_PCS0_O              NXP_SIUL2_PINMUX(0, 0, 37, 4, 0, 0)
#define PTB5_LPSPI0_PCS0_I              NXP_SIUL2_PINMUX(0, 0, 37, 0, 221, 2)
#define PTB5_LPSPI0_PCS1_I              NXP_SIUL2_PINMUX(0, 0, 37, 0, 222, 1)
#define PTB8_LPSPI0_PCS5_O              NXP_SIUL2_PINMUX(0, 0, 40, 6, 0, 0)
#define PTB8_LPSPI0_PCS5_I              NXP_SIUL2_PINMUX(0, 0, 40, 0, 226, 1)
#define PTC2_LPSPI0_PCS2_O              NXP_SIUL2_PINMUX(0, 0, 66, 4, 0, 0)
#define PTC2_LPSPI0_PCS2_I              NXP_SIUL2_PINMUX(0, 0, 66, 0, 223, 2)
#define PTC6_LPSPI0_PCS1_O              NXP_SIUL2_PINMUX(0, 0, 70, 6, 0, 0)
#define PTC6_LPSPI0_PCS1_I              NXP_SIUL2_PINMUX(0, 0, 70, 0, 222, 4)
#define PTC7_LPSPI0_PCS0_O              NXP_SIUL2_PINMUX(0, 0, 71, 6, 0, 0)
#define PTC7_LPSPI0_PCS0_I              NXP_SIUL2_PINMUX(0, 0, 71, 0, 221, 6)
#define PTC8_LPSPI0_SCK_O               NXP_SIUL2_PINMUX(0, 0, 72, 6, 0, 0)
#define PTC8_LPSPI0_SCK_I               NXP_SIUL2_PINMUX(0, 0, 72, 0, 229, 1)
#define PTC9_LPSPI0_SIN_O               NXP_SIUL2_PINMUX(0, 0, 73, 6, 0, 0)
#define PTC9_LPSPI0_SIN_I               NXP_SIUL2_PINMUX(0, 0, 73, 0, 230, 2)
#define PTD5_LPSPI0_PCS1_O              NXP_SIUL2_PINMUX(0, 0, 101, 7, 0, 0)
#define PTD5_LPSPI0_PCS1_I              NXP_SIUL2_PINMUX(0, 0, 101, 0, 222, 5)
#define PTD6_LPSPI0_PCS0_O              NXP_SIUL2_PINMUX(0, 0, 102, 7, 0, 0)
#define PTD6_LPSPI0_PCS0_I              NXP_SIUL2_PINMUX(0, 0, 102, 0, 221, 7)
#define PTD7_LPSPI0_PCS3_O              NXP_SIUL2_PINMUX(0, 0, 103, 4, 0, 0)
#define PTD7_LPSPI0_PCS3_I              NXP_SIUL2_PINMUX(0, 0, 103, 0, 224, 2)
#define PTD10_LPSPI0_SIN_O              NXP_SIUL2_PINMUX(0, 0, 106, 5, 0, 0)
#define PTD10_LPSPI0_SIN_I              NXP_SIUL2_PINMUX(0, 0, 106, 0, 230, 4)
#define PTD11_LPSPI0_SCK_O              NXP_SIUL2_PINMUX(0, 0, 107, 6, 0, 0)
#define PTD11_LPSPI0_SCK_I              NXP_SIUL2_PINMUX(0, 0, 107, 0, 229, 5)
#define PTD12_LPSPI0_SOUT_O             NXP_SIUL2_PINMUX(0, 0, 108, 6, 0, 0)
#define PTD12_LPSPI0_SOUT_I             NXP_SIUL2_PINMUX(0, 0, 108, 0, 231, 5)
#define PTD15_LPSPI0_SCK_O              NXP_SIUL2_PINMUX(0, 0, 111, 4, 0, 0)
#define PTD15_LPSPI0_SCK_I              NXP_SIUL2_PINMUX(0, 0, 111, 0, 229, 3)
#define PTD16_LPSPI0_SIN_O              NXP_SIUL2_PINMUX(0, 0, 112, 4, 0, 0)
#define PTD16_LPSPI0_SIN_I              NXP_SIUL2_PINMUX(0, 0, 112, 0, 230, 3)
#define PTE0_LPSPI0_SIN_O               NXP_SIUL2_PINMUX(0, 0, 128, 2, 0, 0)
#define PTE0_LPSPI0_SIN_I               NXP_SIUL2_PINMUX(0, 0, 128, 0, 230, 1)
#define PTE1_LPSPI0_SCK_O               NXP_SIUL2_PINMUX(0, 0, 129, 2, 0, 0)
#define PTE1_LPSPI0_SCK_I               NXP_SIUL2_PINMUX(0, 0, 129, 0, 229, 2)
#define PTE2_LPSPI0_SOUT_O              NXP_SIUL2_PINMUX(0, 0, 130, 2, 0, 0)
#define PTE2_LPSPI0_SOUT_I              NXP_SIUL2_PINMUX(0, 0, 130, 0, 231, 1)
#define PTE4_LPSPI0_PCS0_O              NXP_SIUL2_PINMUX(0, 0, 132, 1, 0, 0)
#define PTE4_LPSPI0_PCS0_I              NXP_SIUL2_PINMUX(0, 0, 132, 0, 221, 5)
#define PTE6_LPSPI0_PCS2_O              NXP_SIUL2_PINMUX(0, 0, 134, 2, 0, 0)
#define PTE6_LPSPI0_PCS2_I              NXP_SIUL2_PINMUX(0, 0, 134, 0, 223, 1)
#define PTF28_LPSPI0_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 188, 5, 0, 0)
#define PTF28_LPSPI0_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 188, 0, 221, 4)

/* TRGMUX */
#define PTA0_TRGMUX_OUT3                NXP_SIUL2_PINMUX(0, 0, 0, 7, 0, 0)
#define PTA1_TRGMUX_OUT0                NXP_SIUL2_PINMUX(0, 0, 1, 7, 0, 0)
#define PTA18_TRGMUX_IN12               NXP_SIUL2_PINMUX(0, 0, 18, 0, 356, 1)
#define PTA19_TRGMUX_IN13               NXP_SIUL2_PINMUX(0, 0, 19, 0, 357, 1)
#define PTA20_TRGMUX_IN14               NXP_SIUL2_PINMUX(0, 0, 20, 0, 358, 1)
#define PTA21_TRGMUX_IN15               NXP_SIUL2_PINMUX(0, 0, 21, 0, 359, 1)
#define PTA31_TRGMUX_OUT8               NXP_SIUL2_PINMUX(0, 0, 31, 7, 0, 0)
#define PTB2_TRGMUX_IN3                 NXP_SIUL2_PINMUX(0, 0, 34, 0, 347, 1)
#define PTB3_TRGMUX_IN2                 NXP_SIUL2_PINMUX(0, 0, 35, 0, 346, 1)
#define PTB4_TRGMUX_IN1                 NXP_SIUL2_PINMUX(0, 0, 36, 0, 345, 1)
#define PTB5_TRGMUX_IN0                 NXP_SIUL2_PINMUX(0, 0, 37, 0, 344, 1)
#define PTB18_TRGMUX_OUT9               NXP_SIUL2_PINMUX(0, 0, 50, 7, 0, 0)
#define PTB19_TRGMUX_OUT10              NXP_SIUL2_PINMUX(0, 0, 51, 7, 0, 0)
#define PTB20_TRGMUX_OUT11              NXP_SIUL2_PINMUX(0, 0, 52, 7, 0, 0)
#define PTB21_TRGMUX_OUT12              NXP_SIUL2_PINMUX(0, 0, 53, 7, 0, 0)
#define PTB22_TRGMUX_OUT13              NXP_SIUL2_PINMUX(0, 0, 54, 7, 0, 0)
#define PTB23_TRGMUX_OUT14              NXP_SIUL2_PINMUX(0, 0, 55, 7, 0, 0)
#define PTC10_TRGMUX_IN11               NXP_SIUL2_PINMUX(0, 0, 74, 0, 355, 1)
#define PTC11_TRGMUX_IN10               NXP_SIUL2_PINMUX(0, 0, 75, 0, 354, 1)
#define PTC14_TRGMUX_IN9                NXP_SIUL2_PINMUX(0, 0, 78, 0, 353, 1)
#define PTC15_TRGMUX_IN8                NXP_SIUL2_PINMUX(0, 0, 79, 0, 352, 1)
#define PTC24_TRGMUX_OUT15              NXP_SIUL2_PINMUX(0, 0, 88, 7, 0, 0)
#define PTD0_TRGMUX_OUT1                NXP_SIUL2_PINMUX(0, 0, 96, 7, 0, 0)
#define PTD1_TRGMUX_OUT2                NXP_SIUL2_PINMUX(0, 0, 97, 7, 0, 0)
#define PTD2_TRGMUX_IN5                 NXP_SIUL2_PINMUX(0, 0, 98, 0, 349, 1)
#define PTD3_TRGMUX_IN4                 NXP_SIUL2_PINMUX(0, 0, 99, 0, 348, 1)
#define PTD5_TRGMUX_IN7                 NXP_SIUL2_PINMUX(0, 0, 101, 0, 351, 1)
#define PTE3_TRGMUX_IN6                 NXP_SIUL2_PINMUX(0, 0, 131, 0, 350, 1)
#define PTE10_TRGMUX_OUT4               NXP_SIUL2_PINMUX(0, 0, 138, 7, 0, 0)
#define PTE11_TRGMUX_OUT5               NXP_SIUL2_PINMUX(0, 0, 139, 7, 0, 0)
#define PTE15_TRGMUX_OUT6               NXP_SIUL2_PINMUX(0, 0, 143, 7, 0, 0)
#define PTE16_TRGMUX_OUT7               NXP_SIUL2_PINMUX(0, 0, 144, 7, 0, 0)

