zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K344_K324_K314_257BGA-pinctrl.h
/* TRACE */
#define PTC2_TRACE_ETM_CLKOUT           NXP_SIUL2_PINMUX(0, 0, 66, 6, 0, 0)
#define PTD7_TRACE_ETM_D0               NXP_SIUL2_PINMUX(0, 0, 103, 6, 0, 0)
#define PTD10_TRACE_ETM_D3              NXP_SIUL2_PINMUX(0, 0, 106, 4, 0, 0)
#define PTD11_TRACE_ETM_D2              NXP_SIUL2_PINMUX(0, 0, 107, 4, 0, 0)
#define PTD12_TRACE_ETM_D1              NXP_SIUL2_PINMUX(0, 0, 108, 4, 0, 0)
#define PTF28_TRACE_ETM_D5              NXP_SIUL2_PINMUX(0, 0, 188, 7, 0, 0)
#define PTF31_TRACE_ETM_D3              NXP_SIUL2_PINMUX(0, 0, 191, 7, 0, 0)
#define PTG6_TRACE_ETM_CLKOUT           NXP_SIUL2_PINMUX(0, 0, 198, 7, 0, 0)
#define PTG7_TRACE_ETM_D0               NXP_SIUL2_PINMUX(0, 0, 199, 7, 0, 0)
#define PTG15_TRACE_ETM_D1              NXP_SIUL2_PINMUX(0, 0, 207, 7, 0, 0)
#define PTG16_TRACE_ETM_D2              NXP_SIUL2_PINMUX(0, 0, 208, 7, 0, 0)
#define PTG17_TRACE_ETM_D4              NXP_SIUL2_PINMUX(0, 0, 209, 7, 0, 0)
#define PTG18_TRACE_ETM_D6              NXP_SIUL2_PINMUX(0, 0, 210, 7, 0, 0)
#define PTG19_TRACE_ETM_D7              NXP_SIUL2_PINMUX(0, 0, 211, 7, 0, 0)
#define PTG20_TRACE_ETM_D8              NXP_SIUL2_PINMUX(0, 0, 212, 7, 0, 0)
#define PTG21_TRACE_ETM_D9              NXP_SIUL2_PINMUX(0, 0, 213, 7, 0, 0)
#define PTG22_TRACE_ETM_D10             NXP_SIUL2_PINMUX(0, 0, 214, 7, 0, 0)
#define PTG23_TRACE_ETM_D11             NXP_SIUL2_PINMUX(0, 0, 215, 7, 0, 0)
#define PTG24_TRACE_ETM_D12             NXP_SIUL2_PINMUX(0, 0, 216, 7, 0, 0)
#define PTG25_TRACE_ETM_D13             NXP_SIUL2_PINMUX(0, 0, 217, 7, 0, 0)
#define PTG26_TRACE_ETM_D14             NXP_SIUL2_PINMUX(0, 0, 218, 7, 0, 0)
#define PTG27_TRACE_ETM_D15             NXP_SIUL2_PINMUX(0, 0, 219, 7, 0, 0)

/* QUADSPI */
#define PTC2_QUADSPI_IOFA3_O            NXP_SIUL2_PINMUX(0, 0, 66, 7, 0, 0)
#define PTC2_QUADSPI_IOFA3_I            NXP_SIUL2_PINMUX(0, 0, 66, 0, 308, 1)
#define PTC3_QUADSPI_PCSFA              NXP_SIUL2_PINMUX(0, 0, 67, 6, 0, 0)
#define PTD7_QUADSPI_IOFA1_O            NXP_SIUL2_PINMUX(0, 0, 103, 7, 0, 0)
#define PTD7_QUADSPI_IOFA1_I            NXP_SIUL2_PINMUX(0, 0, 103, 0, 306, 1)
#define PTD10_QUADSPI_SCKFA_O           NXP_SIUL2_PINMUX(0, 0, 106, 7, 0, 0)
#define PTD10_QUADSPI_SCKFA_I           NXP_SIUL2_PINMUX(0, 0, 106, 0, 309, 1)
#define PTD11_QUADSPI_IOFA0_O           NXP_SIUL2_PINMUX(0, 0, 107, 7, 0, 0)
#define PTD11_QUADSPI_IOFA0_I           NXP_SIUL2_PINMUX(0, 0, 107, 0, 305, 1)
#define PTD12_QUADSPI_IOFA2_O           NXP_SIUL2_PINMUX(0, 0, 108, 7, 0, 0)
#define PTD12_QUADSPI_IOFA2_I           NXP_SIUL2_PINMUX(0, 0, 108, 0, 307, 1)

/* LPI2C1 */
#define PTC5_LPI2C1_HREQ                NXP_SIUL2_PINMUX(0, 0, 69, 0, 216, 2)
#define PTC6_LPI2C1_SDA_O               NXP_SIUL2_PINMUX(0, 0, 70, 1, 0, 0)
#define PTC6_LPI2C1_SDA_I               NXP_SIUL2_PINMUX(0, 0, 70, 0, 219, 2)
#define PTC7_LPI2C1_SCL_O               NXP_SIUL2_PINMUX(0, 0, 71, 3, 0, 0)
#define PTC7_LPI2C1_SCL_I               NXP_SIUL2_PINMUX(0, 0, 71, 0, 217, 1)
#define PTC15_LPI2C1_SCL_O              NXP_SIUL2_PINMUX(0, 0, 79, 7, 0, 0)
#define PTC15_LPI2C1_SCL_I              NXP_SIUL2_PINMUX(0, 0, 79, 0, 217, 6)
#define PTC16_LPI2C1_SDAS_O             NXP_SIUL2_PINMUX(0, 0, 80, 4, 0, 0)
#define PTC16_LPI2C1_SDA_O              NXP_SIUL2_PINMUX(0, 0, 80, 7, 0, 0)
#define PTC16_LPI2C1_SDA_I              NXP_SIUL2_PINMUX(0, 0, 80, 0, 219, 5)
#define PTC16_LPI2C1_SDAS_I             NXP_SIUL2_PINMUX(0, 0, 80, 0, 220, 1)
#define PTC17_LPI2C1_SCLS_O             NXP_SIUL2_PINMUX(0, 0, 81, 4, 0, 0)
#define PTC17_LPI2C1_SCLS_I             NXP_SIUL2_PINMUX(0, 0, 81, 0, 218, 2)
#define PTC28_LPI2C1_SCL_O              NXP_SIUL2_PINMUX(0, 0, 92, 5, 0, 0)
#define PTC28_LPI2C1_SCL_I              NXP_SIUL2_PINMUX(0, 0, 92, 0, 217, 4)
#define PTC29_LPI2C1_SDA_O              NXP_SIUL2_PINMUX(0, 0, 93, 5, 0, 0)
#define PTC29_LPI2C1_SDA_I              NXP_SIUL2_PINMUX(0, 0, 93, 0, 219, 3)
#define PTD8_LPI2C1_SDA_O               NXP_SIUL2_PINMUX(0, 0, 104, 2, 0, 0)
#define PTD8_LPI2C1_SDA_I               NXP_SIUL2_PINMUX(0, 0, 104, 0, 219, 1)
#define PTD9_LPI2C1_SCL_O               NXP_SIUL2_PINMUX(0, 0, 105, 2, 0, 0)
#define PTD9_LPI2C1_SCL_I               NXP_SIUL2_PINMUX(0, 0, 105, 0, 217, 2)
#define PTD12_LPI2C1_HREQ               NXP_SIUL2_PINMUX(0, 0, 108, 0, 216, 1)
#define PTF7_LPI2C1_SCL_O               NXP_SIUL2_PINMUX(0, 0, 167, 3, 0, 0)
#define PTF7_LPI2C1_SCL_I               NXP_SIUL2_PINMUX(0, 0, 167, 0, 217, 5)
#define PTF8_LPI2C1_SDA_O               NXP_SIUL2_PINMUX(0, 0, 168, 3, 0, 0)
#define PTF8_LPI2C1_SDA_I               NXP_SIUL2_PINMUX(0, 0, 168, 0, 219, 4)

/* CAN2 */
#define PTC6_CAN2_RX                    NXP_SIUL2_PINMUX(0, 0, 70, 0, 2, 6)
#define PTC7_CAN2_TX                    NXP_SIUL2_PINMUX(0, 0, 71, 7, 0, 0)
#define PTC14_CAN2_RX                   NXP_SIUL2_PINMUX(0, 0, 78, 0, 2, 2)
#define PTC15_CAN2_TX                   NXP_SIUL2_PINMUX(0, 0, 79, 1, 0, 0)
#define PTC16_CAN2_RX                   NXP_SIUL2_PINMUX(0, 0, 80, 0, 2, 1)
#define PTC17_CAN2_TX                   NXP_SIUL2_PINMUX(0, 0, 81, 3, 0, 0)
#define PTD18_CAN2_TX                   NXP_SIUL2_PINMUX(0, 0, 114, 1, 0, 0)
#define PTD19_CAN2_RX                   NXP_SIUL2_PINMUX(0, 0, 115, 0, 2, 4)
#define PTE24_CAN2_TX                   NXP_SIUL2_PINMUX(0, 0, 152, 3, 0, 0)
#define PTE25_CAN2_RX                   NXP_SIUL2_PINMUX(0, 0, 153, 0, 2, 3)
#define PTF25_CAN2_TX                   NXP_SIUL2_PINMUX(0, 0, 185, 1, 0, 0)
#define PTF26_CAN2_RX                   NXP_SIUL2_PINMUX(0, 0, 186, 0, 2, 5)

/* CAN5 */
#define PTC10_CAN5_TX                   NXP_SIUL2_PINMUX(0, 0, 74, 3, 0, 0)
#define PTC11_CAN5_RX                   NXP_SIUL2_PINMUX(0, 0, 75, 0, 5, 2)
#define PTC26_CAN5_RX                   NXP_SIUL2_PINMUX(0, 0, 90, 0, 5, 5)
#define PTC27_CAN5_TX                   NXP_SIUL2_PINMUX(0, 0, 91, 1, 0, 0)
#define PTD17_CAN5_RX                   NXP_SIUL2_PINMUX(0, 0, 113, 0, 5, 1)
#define PTE12_CAN5_TX                   NXP_SIUL2_PINMUX(0, 0, 140, 2, 0, 0)
#define PTF4_CAN5_TX                    NXP_SIUL2_PINMUX(0, 0, 164, 1, 0, 0)
#define PTF5_CAN5_RX                    NXP_SIUL2_PINMUX(0, 0, 165, 0, 5, 3)
#define PTG13_CAN5_TX                   NXP_SIUL2_PINMUX(0, 0, 205, 1, 0, 0)
#define PTG14_CAN5_RX                   NXP_SIUL2_PINMUX(0, 0, 206, 0, 5, 4)

/* LPUART10 */
#define PTC12_LPUART10_RX               NXP_SIUL2_PINMUX(0, 0, 76, 0, 197, 2)
#define PTC13_LPUART10_TX_O             NXP_SIUL2_PINMUX(0, 0, 77, 1, 0, 0)
#define PTC13_LPUART10_TX_I             NXP_SIUL2_PINMUX(0, 0, 77, 0, 373, 1)
#define PTE2_LPUART10_RX                NXP_SIUL2_PINMUX(0, 0, 130, 0, 197, 1)
#define PTE6_LPUART10_TX_O              NXP_SIUL2_PINMUX(0, 0, 134, 5, 0, 0)
#define PTE6_LPUART10_TX_I              NXP_SIUL2_PINMUX(0, 0, 134, 0, 373, 2)
#define PTF12_LPUART10_TX_O             NXP_SIUL2_PINMUX(0, 0, 172, 1, 0, 0)
#define PTF12_LPUART10_TX_I             NXP_SIUL2_PINMUX(0, 0, 172, 0, 373, 3)
#define PTF13_LPUART10_RX               NXP_SIUL2_PINMUX(0, 0, 173, 0, 197, 3)

/* LPUART12 */
#define PTC24_LPUART12_TX_O             NXP_SIUL2_PINMUX(0, 0, 88, 1, 0, 0)
#define PTC24_LPUART12_TX_I             NXP_SIUL2_PINMUX(0, 0, 88, 0, 375, 1)
#define PTC25_LPUART12_RX               NXP_SIUL2_PINMUX(0, 0, 89, 0, 199, 2)
#define PTE4_LPUART12_TX_O              NXP_SIUL2_PINMUX(0, 0, 132, 5, 0, 0)
#define PTE4_LPUART12_TX_I              NXP_SIUL2_PINMUX(0, 0, 132, 0, 375, 2)
#define PTE5_LPUART12_RX                NXP_SIUL2_PINMUX(0, 0, 133, 0, 199, 1)
#define PTF16_LPUART12_TX_O             NXP_SIUL2_PINMUX(0, 0, 176, 1, 0, 0)
#define PTF16_LPUART12_TX_I             NXP_SIUL2_PINMUX(0, 0, 176, 0, 375, 3)
#define PTF17_LPUART12_RX               NXP_SIUL2_PINMUX(0, 0, 177, 0, 199, 3)

/* SAI1 */
#define PTD13_SAI1_D0_O                 NXP_SIUL2_PINMUX(0, 0, 109, 6, 0, 0)
#define PTD13_SAI1_D0_I                 NXP_SIUL2_PINMUX(0, 0, 109, 0, 323, 1)
#define PTD14_SAI1_MCLK                 NXP_SIUL2_PINMUX(0, 0, 110, 0, 324, 1)
#define PTD15_SAI1_SYNC_O               NXP_SIUL2_PINMUX(0, 0, 111, 6, 0, 0)
#define PTD15_SAI1_SYNC_I               NXP_SIUL2_PINMUX(0, 0, 111, 0, 325, 1)
#define PTE8_SAI1_BCLK_O                NXP_SIUL2_PINMUX(0, 0, 136, 6, 0, 0)
#define PTE8_SAI1_BCLK_I                NXP_SIUL2_PINMUX(0, 0, 136, 0, 322, 1)

/* TRGMUX INTERNAL */
#define TRGMUX_INT_OUT37_EMIOS_0_CH6_G  NXP_SIUL2_PINMUX(0, 0, 17, 0, 54, 3)
#define TRGMUX_INT_OUT38_EMIOS_0_CH7_G  NXP_SIUL2_PINMUX(0, 0, 135, 0, 55, 4)
#endif /* HAL_NXP_DTS_NXP_S32_S32K344_K324_K314_257BGA_PINCTRL_H_ */
